tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Platform built on V8 to build network applications
brew "node"
# Distributed Code Component Manager
brew "bit"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Desktop app for inspecting React JS and React Native projects
cask "reactotron"
# Graphical client for Git version control
cask "sourcetree"
# Open-source code editor
cask "visual-studio-code"
